app/views/questions/show.html.erb

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 3]]
---
          <div class="answer">
            <% @question.answers.each do |answer| %>

SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."answer_id" = ? LIMIT ?  [["user_id", 1], ["answer_id", 11], ["LIMIT", 1]]
---
                  <% elsif current_user.like?(answer) %>
                    <%= form_for(current_user.likes.find_by(answer_id: answer.id), method: :delete) do |f| %>

SELECT "responses".* FROM "responses" WHERE "responses"."answer_id" = ?  [["answer_id", 6]]
---
              <div class="responses">
                <% answer.responses.each do |response| %>