app/controllers/answers_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? ORDER BY "questions"."created_at" DESC LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "answers" ("content", "user_id", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "aaa"], ["user_id", 1], ["question_id", 3], ["created_at", "2018-06-18 10:14:11.210757"], ["updated_at", "2018-06-18 10:14:11.210757"]]
---
  def create
    @question = Question.find_by(id: session[:question_id])
    params[:answer][:question_id] = session[:question_id]
    params[:answer][:user_id]     = current_user.id
    @answer = @question.answers.build(params.require(:answer).permit(:content, :question_id, :user_id))
    if @answer.save

SELECT  "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? ORDER BY "questions"."created_at" DESC LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "answers" WHERE "answers"."id" = ?  [["id", 3]]
---
  def destroy
    @answer = Answer.find_by(id: params[:id])
    @question = Question.find_by(id: @answer.question_id)
    @answer.destroy

SELECT  "questions".* FROM "questions" WHERE "questions"."user_id" = ? AND "questions"."id" IS NULL ORDER BY "questions"."created_at" DESC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
    def correct_user
      @question = current_user.questions.find_by(id: params[:id])