app/controllers/likes_controller.rb

  def create
    answer = Answer.find_by(id: params[:answer_id])
---
SELECT  "answers".* FROM "answers" WHERE "answers"."answer_id" = ? LIMIT ?  [["answer_id", "6"], ["LIMIT", 1]]

  def destroy
    answer = Answer.find_by(id: params[:answer_id])
---
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]