app/controllers/questions_controller.rb

  def show
    session[:question_id] = params[:id]
    @question = Question.find_by(id: params[:id])
    @user = User.find_by(id: @question.user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]