app/controllers/questions_controller.rb

  def index
    @questions = Question.page(params[:page]).per(PER)
---
SELECT "questions".* FROM "questions" ORDER BY "questions"."created_at" DESC

  def create
    @question = current_user.questions.build(question_params)
    if @question.save
---
INSERT INTO "questions" ("title", "tag", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "w"], ["tag", "w"], ["content", "w"], ["user_id", 1], ["created_at", "2018-06-17 00:29:50.477094"], ["updated_at", "2018-06-17 00:29:50.477094"]]

  def show
    session[:question_id] = params[:id]
    @question = Question.find_by(id: params[:id])
    @user = User.find_by(id: @question.user_id)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? ORDER BY "questions"."created_at" DESC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? ORDER BY "questions"."created_at" DESC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @question = Question.find_by(id: params[:id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? ORDER BY "questions"."created_at" DESC LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def update
    @question = Question.find_by(id: params[:id])
    if @question.update_attributes(question_params)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? ORDER BY "questions"."created_at" DESC LIMIT ?  [["id", 0], ["LIMIT", 1]]
UPDATE "questions" SET "title" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["title", "eee2"], ["updated_at", "2018-06-21 11:14:43.604359"], ["id", 7]]

  def destroy
    @question = Question.find_by(id: params[:id])
    @question.destroy
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? ORDER BY "questions"."created_at" DESC LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 8]]

    def correct_user
      @question = current_user.questions.find_by(id: params[:id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."user_id" = ? AND "questions"."id" = ? ORDER BY "questions"."created_at" DESC LIMIT ?  [["user_id", 1], ["id", 7], ["LIMIT", 1]]