app/controllers/responses_controller.rb

  def create
    @question = Question.find_by(id: session[:question_id])
    @answer = Answer.find_by(id: params[:response][:answer_id])
    params[:response][:user_id] = current_user.id
    params[:response][:question_id] = session[:question_id]
    @response = @answer.responses.build(response_params)
    if @response.save
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? ORDER BY "questions"."created_at" DESC LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
INSERT INTO "responses" ("content", "user_id", "question_id", "answer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)