app/controllers/static_pages_controller.rb

  def home
    @questions = Question.page(params[:page]).per(PER)
---
SELECT  "questions".* FROM "questions" ORDER BY "questions"."created_at" DESC LIMIT ?  [["LIMIT", 11]]