app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" ORDER BY "questions"."created_at" DESC
---
  def show
    @user = User.find_by(id: params[:id])
    @questions = Question.page(params[:page]).per(PER)