app/models/user.rb

INSERT INTO "likes" ("user_id", "answer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["answer_id", 11], ["created_at", "2018-06-22 05:25:53.496972"], ["updated_at", "2018-06-22 05:25:53.496972"]]
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."answer_id" = ? LIMIT ?  [["user_id", 1], ["answer_id", 11], ["LIMIT", 1]]
---
  def like(answer)
    self.likes.find_or_create_by(answer_id: answer.id)

SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."answer_id" = ? LIMIT ?  [["user_id", 1], ["answer_id", 11], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 2]]
---
  def unlike(answer)
    like = self.likes.find_by(answer_id: answer.id)
    like.destroy if like